{
  "firstName": "Dan",
  "lastName": "Anglin",
  "jobTitle": "Platform Automation Engineer",
  "contact": {
    "email": "d.n.i.anglin@gmail.com",
    "location": "Hertfordshire, UK"
  },
  "links": {
    "gitlab": "gitlab.com/dananglin",
    "github": "github.com/dananglin"
  },
  "summary": [
    "I have over five years of professional experience in DevOps and Platform Automation.",
    "My experience ranges from provisioning virtual machines and automating software installation using Ansible and Puppet",
    "to provisioning new Kubernetes environments using GitOps and creating Operators for the auto-provisioning and maintenance of PostgreSQL clusters on Kubernetes.",
    "Throughout my time at Ocado Technology I have used Go to build automated services in Kubernetes and have been training myself to develop",
    "my skills and understanding of the language.",
    "I am very keen on continuing using Go more professionally and I am aiming to transition my career from DevOps Engineering to Software Engineering."
  ],
  "technologies": [
    {
      "category": "Programming Languages",
      "values": [
        "Go",
        "Bash",
        "Python"
      ]
    },
    {
      "category": "Cloud Hosting",
      "values": [
        "AWS",
        "Openstack",
        "UKCloud"
      ]
    },
    {
      "category": "Containerisation",
      "values": [
        "Docker",
        "Kubernetes",
        "LXD"
      ]
    },
    {
      "category": "Continuous Integration",
      "values": [
        "Git",
        "GitLab",
        "Gitea",
        "GitLab CI",
        "Drone",
        "Nexus",
        "Jenkins"
      ]
    },
    {
      "category": "Monitoring and Alerting",
      "values": [
        "Prometheus",
        "Alertmanager",
        "Grafana"
      ]
    },
    {
      "category": "Other Tools, Services or Frameworks",
      "values": [
        "GNU/Linux",
        "Elasticsearch",
        "Logstash",
        "Fluentd",
        "Kibana",
        "Ansible",
        "Puppet",
        "OpenAPI v3",
        "PostgreSQL",
        "HAProxy",
        "Kanban",
        "Scrum",
        "JIRA"
      ]
    }
  ],
  "employment": [
    {
      "company": "Ocado Technology",
      "location": "Hatfield, Hertfordshire",
      "jobTitle": "Platform Automation Engineer",
      "duration": {
        "start": {
          "year": "2017",
          "month": "January"
        },
        "end": {
          "year": "2020",
          "month": "January"
        }
      },
      "details": [
        "I've created a Postgres Operator using Go and the Metacontroller which is used to create and manage Patroni PostgreSQL clusters onto production Kubernetes environments.",
        "I've provided assistance for creating a Cassandra Operator using Go.",
        "I've deployed new SIT Kubernetes environments on Openstack using GitOps.",
        "I've created management services on Kubernetes using CronJobs to automate the maintenance of Elasticsearch clusters.",
        "I've deployed Prometheus, Alertmanager and Grafana onto Kubernetes for monitoring database services such as PostgreSQL, Cassandra and Elasticsearch.",
        "I was part of the monitoring and alerting work group to help integrate all infrastructure monitoring stacks into a centralised monitoring service.",
        "I've supported development tools such as GitLab and Nexus in AWS by performing various upgrade and maintenance tasks via CloudFormation and Puppet.",
        "I've used AWS CloudFormation and ECS to provision a monitoring stack for GitLab."
      ]
    },
    {
      "company": "QA Consulting (Contracted to CACI)",
      "location": "London",
      "jobTitle": "DevOps Consultant",
      "duration": {
        "start": {
          "year": "2015",
          "month": "March"
        },
        "end": {
          "year": "2016",
          "month": "November"
        }
      },
      "details": [
        "I've built and supported production infrastructure hosted in UKCloud (for public sector projects) and AWS (for commercial projects).",
        "My general tasks included creating Ansible playbooks for network configuration, hardening of RedHat/CentOS virtual machines and for software installation and configuration.",
        "I've set up resilient and fault-tolerant infrastructure using tools such as HAProxy and Keepalive.",
        "I've built a cross-domain protective monitoring solution using the Elastic stack with Redis.",
        "I've installed and configured Nagios/Icinga for infrastructure monitoring.",
        "I was involved in setting up the production Docker environment for a government website."
      ]
    },
    {
      "company": "QA Consulting (Contracted to IBM)",
      "location": "Home Office, London",
      "jobTitle": "DevOps Consultant",
      "duration": {
        "start": {
          "year": "2014",
          "month": "October"
        },
        "end": {
          "year": "2015",
          "month": "March"
        }
      },
      "details": [
        "I've built and supported new development, CIT and SIT environments for new projects at the Home Office.",
        "These environments were built on UKCloud using Jenkins and UKCloud's REST API.",
        "Linux (RedHat/CentOS) virtual machines were provisioned and hardened using Puppet and Jenkins.",
        "I've learnt how to work in an Agile environment with Scrum; using JIRA for keeping track of my sprint tasks.",
        "I've used Confluence it to create documentation for new starters in the DevOps space."
      ]
    },
    {
      "company": "QA Consulting",
      "location": "Worthing",
      "jobTitle": "Trainee DevOps Consultant",
      "duration": {
        "start": {
          "year": "2014",
          "month": "September"
        },
        "end": {
          "year": "2014",
          "month": "October"
        }
      },
      "details": [
        "I've spent eight weeks in training to become a DevOps Consultant on behalf of QA Consulting.",
        "I've completed a two week intensive training course on business analysis. Training course covered client engagement, business process modelling, use case modelling and process and evaluation improvements.",
        "I then completed a six week hands-on training course on the fundamentals of DevOps and Continuous Integration.",
        "The DevOps training course consisted of learning about various software such as Puppet, Jenkins, Nexus, Maven, Git, Tomcat and the Atlassian tools.",
        "The training also included using Vagrant and Puppet to automate the provisioning of small CI and development environments for the continuous delivery of internal Java projects."
      ]
    },
    {
      "company": "School of Systems Engineering, University of Reading",
      "location": "Reading",
      "jobTitle": "Undergraduate Researcher",
      "duration": {
        "start": {
          "year": "2012",
          "month": "July"
        },
        "end": {
          "year": "2012",
          "month": "September"
        }
      },
      "details": [
        "This was a summer internship where I helped developed an interactive Java application that processes Terahertz signals in order to reveal hidden details behind walls.",
        "This was aimed at those who were not specialised in Terahertz signals to use an application to aid in their research in archaeology.",
        "The hidden details were captured in images or videos that could be viewed in a 2D or a 3D virtual environment.",
        "During this internship I learnt new techniques for processing Terahertz signals.",
        "I was able to use sample Terahertz data to reveal and display hidden details within a 3D virtual environment."
      ]
    }
  ],
  "education": [
    {
      "school": "University of Reading",
      "location": "Reading",
      "qualification": "MEng (Hons) in Robotics, 2:1",
      "duration": {
        "start": {
          "year": "2009",
          "month": "October"
        },
        "end": {
          "year": "2013",
          "month": "July"
        }
      }
    },
    {
      "school": "St Angela's & St Bonaventure's Sixth Form College",
      "location": "London",
      "qualification": "A-Levels in Maths, Physics and Product Design",
      "duration": {
        "start": {
          "year": "2007",
          "month": "September"
        },
        "end": {
          "year": "2009",
          "month": "July"
        }
      }
    }
  ],
  "interests": [
    "I enjoy walking/hiking.",
    "I have enjoyed small hikes around London,",
    "between different towns and villages of Hertfordshire",
    "and also along the south coast.",
    "Ingress (an augmented reality and location-based game) has helped me to discover",
    "hidden gems of London and Hertfordshire including",
    "Ellenbrook Fields in Hatfield and a hidden rail trail within Welwyn Garden City.",
    "I'm currently studying Japanese using textbooks to cover the fundamentals and podcasts and radio stations for immersion.",
    "I'm aiming to start taking the JLPT starting from N5 in July this year.",
    "I mainly keep up-to-date with tech news using news aggregation sites such as Reddit and Hacker News."
  ]
}
